# Headings1
## Headings2
### Headings3

*text italic*
**text bold**

In [14]:
import pandas

In [15]:
import random

In [ ]:
#liat history command
%history

### Latihan

In [13]:
# hitung function yang bisa itung jumlah kata dalam sebuah kalimat

def itung_kata(str1, str2):
    list_kata = str2.split()
    retval = 0
    for i in list_kata:
        if i == str1:
            retval+=1
    return retval
    
val = itung_kata('aku', 'aku adalah aku anak gembala')
print(val)

2

In [24]:
random.randint(-5, 8)

-3

In [27]:
#import library sndiri
import hitung

In [28]:
hitung.hitung_kata('aku', 'aku adalah aku anak gembala')

2

In [55]:
#latihan
def hadiah(nama):
    prize = {
        1 : 'mobil',
        2 : 'motor',
        3 : 'tv',
        4 : 'sepeda',
        5 : 'uang tunai'
    }
    hadiah = random.randint(1,4)
    print('Selamat {}! Kamu menang {}'.format(nama,prize[hadiah]))
    
hadiah('ifan')

Selamat ifan! Kamu menang motor

In [69]:
def invest_calc(invest, month, interest):
    i = 0
    print('uang awal ',invest )
    while i < month:
        invest+=invest*interest/100
        i+=1
    if month < 1:
        print('insert valid month')
    return invest

tot = invest_calc(5000000, 60, 1)
print('uang akhir ',tot)

uang awal  5000000
uang akhir  9083483.492820451

In [70]:
print(range(5))

range(0, 5)

### PANDAS

In [72]:
import pandas as pd

#### Create a dataframe

##### Series

In [74]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

##### Dataframe

In [75]:
data_df = {
    
}

In [78]:
'p'.upper()

'P'

In [80]:
data_df = {'Customer':['tom', 'nick', 'krish', 'jack', 'jack', 'tom', 'jack', 'krish', 'nick', 'nick'],
          'Origin':['Tebet', 'Gondangdia', 'Mampang', 'SCBD', 'SCBD', 'Kuningan', 'Pancoran', 'Tebet', 'Mampang', 'Tebet'],
          'Destination':['Gondangdia', 'Mampang', 'SCBD', 'Kuningan', 'Pancoran', 'Pancoran', 'Mampang', 'SCBD', 'SCBD', 'Kuningan'],
          'Distance': [4.5, 5.0, 3.0, 4.8, 2.2, 4.7, 3.4, 4.0, 2.2, 2.9],
          'Price': [20000, 23000, 14000, 24500, 7000, 20000, 15000, 18500, 9000, 11000]}
          
df = pd.DataFrame(data_df)

df

  Customer      Origin Destination  Distance  Price
0      tom       Tebet  Gondangdia       4.5  20000
1     nick  Gondangdia     Mampang       5.0  23000
2    krish     Mampang        SCBD       3.0  14000
3     jack        SCBD    Kuningan       4.8  24500
4     jack        SCBD    Pancoran       2.2   7000
5      tom    Kuningan    Pancoran       4.7  20000
6     jack    Pancoran     Mampang       3.4  15000
7    krish       Tebet        SCBD       4.0  18500
8     nick     Mampang        SCBD       2.2   9000
9     nick       Tebet    Kuningan       2.9  11000

In [81]:
#add column

In [84]:
df['Rates'] = 2

In [86]:
df['Rates'] = df['Price'] / df['Distance']

In [87]:
df

  Customer      Origin Destination  Distance  Price        Rates
0      tom       Tebet  Gondangdia       4.5  20000  4444.444444
1     nick  Gondangdia     Mampang       5.0  23000  4600.000000
2    krish     Mampang        SCBD       3.0  14000  4666.666667
3     jack        SCBD    Kuningan       4.8  24500  5104.166667
4     jack        SCBD    Pancoran       2.2   7000  3181.818182
5      tom    Kuningan    Pancoran       4.7  20000  4255.319149
6     jack    Pancoran     Mampang       3.4  15000  4411.764706
7    krish       Tebet        SCBD       4.0  18500  4625.000000
8     nick     Mampang        SCBD       2.2   9000  4090.909091
9     nick       Tebet    Kuningan       2.9  11000  3793.103448

In [88]:
#remove column

In [90]:
df = df.remove(columns : 'Rates')

SyntaxError: invalid syntax (<ipython-input-90-1ad07adb81ec>, line 1)

In [92]:
#describe dataframe
##semua data
df.info()
##hanya numerik
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Customer     10 non-null     object
 1   Origin       10 non-null     object
 2   Destination  10 non-null     object
 3   Distance     10 non-null     float64
 4   Price        10 non-null     int64
 5   Rates        10 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 608.0+ bytes

        Distance         Price        Rates
count  10.000000     10.000000    10.000000
mean    3.670000  16200.000000  4317.319235
std     1.071914   5954.456781   533.343702
min     2.200000   7000.000000  3181.818182
25%     2.925000  11750.000000  4132.011605
50%     3.700000  16750.000000  4428.104575
75%     4.650000  20000.000000  4618.750000
max     5.000000  24500.000000  5104.166667

In [ ]:
#buat function ubah suhu dari celcius k reamur dan sebaliknya
input : 1 string
output : 1 string
    
cth
input : 32R
output: ...C
    
input : 32C
output: ...R